app/controllers/articles_controller.rb

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "First article"], ["text", "this is the content for the first article"], ["updated_at", "2015-02-23 09:35:51.805092"], ["id", 9]]